Revit 2027 API
ExporterIFCUtils.GetAttachedColumns Method
 Obtains a list of columns known to Revit as intersecting with this wall.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<FamilyInstance> GetAttachedColumns(
	Wall pWallElem
)
Public Shared Function GetAttachedColumns (
	pWallElem As Wall
) As IList(Of FamilyInstance)
public:
static IList<FamilyInstance^>^ GetAttachedColumns(
	Wall^ pWallElem
)
static member GetAttachedColumns :
        pWallElem : Wall -> IList<FamilyInstance>
Parameters
pWallElem Wall
 The wall.
Return Value
IList<FamilyInstance>
 The columns found.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace